Frontend Auth/BenchBnB/app/controllers/api/benches_controller.rb

    def index
      @benches = bounds ? Bench.in_bounds(params(:bounds)) : Bench.all

      if params[:minSeating] && params[:maxSeating]
        benches = benches.where(seating: seating_range)
---
SELECT "benches".* FROM "benches" WHERE (lat < '37.77397200000002') AND (lat > '37.77397200000002') AND (lng > '-122.50219314868164') AND (lng < '-122.36040085131836') AND "benches"."seating" BETWEEN $1 AND $2  [["seating", 1], ["seating", 10]]